{"Extras/LatexPreamble":{"slug":"Extras/LatexPreamble","filePath":"Extras/LatexPreamble.md","title":"LatexPreamble","links":[],"tags":["hidden"],"content":"\\newcommand\\abs[1]{\\left\\lvert #1 \\right\\rvert}\n\\newcommand\\avg[1]{\\left\\langle #1 \\right\\rangle}\n\n\\newcommand\\diff{\\text{d}}\n\\newcommand\\Diff{\\text{D}}\n\\newcommand\\degree{^{\\circ}}\n\\newcommand\\ihat{\\hat{\\imath}}\n\\newcommand\\jhat{\\hat{\\jmath}}\n\\newcommand\\Jhat{\\hat{J}}\n\\newcommand\\khat{\\hat{k}}\n\\newcommand\\ham{\\hat{H}}\n\\newcommand\\Lhat{\\hat{L}}\n\n\\newcommand\\ehat{\\hat{e}}\n\\newcommand\\ex{\\hat{e}_x}\n\\newcommand\\ey{\\hat{e}_y}\n\\newcommand\\ez{\\hat{e}_z}\n\\newcommand\\et{\\hat{e}_t}\n\n\\newcommand\\matx[1]{\\underline{\\underline{\\mathbf{#1}}}}\n\n\\newcommand\\bra[1]{\\langle #1\\lvert}\n\\newcommand\\ket[1]{\\lvert #1\\rangle}\n\\newcommand\\braket[2]{\\langle #1 \\lvert #2 \\rangle}\n\\newcommand\\Braket[3]{\\langle #1 \\lvert #2 \\lvert #3 \\rangle}\n\n\\newcommand\\stf[1]{\\times 10^{#1}}\n\n\\newcommand\\sol{_{\\odot}}\n\\newcommand\\const{\\text{const.}}\n\\newcommand\\tot{\\text{tot}}\n\n\\newcommand\\curl[1]{\\mathcal{#1}}\n\\newcommand\\zed{\\mathcal{Z}}\n\n\\let\\oldphi\\phi\n\\renewcommand\\phi\\varphi\n\n\\let\\oldepsilon\\epsilon\n\\renewcommand\\epsilon\\varepsilon\n\n\\newcommand\\diffr[3]{\\dfrac{\\diff^{#3} #1}{\\diff #2^{#3}}}\n\\newcommand\\diffrat[4]{\\left.\\dfrac{\\diff^{#3} #1}{\\diff #2^{#3}}\\right\\lvert_{#4}\\!\\!\\!\\!}\n\n\\newcommand\\partr[3]{\\dfrac{\\partial^{#3} #1}{\\partial #2^{#3}}}\n\\newcommand\\partrat[4]{\\left.\\dfrac{\\partial^{#3} #1}{\\partial #2^{#3}}\\right\\lvert_{#4}\\!\\!\\!\\!}\n\n\\newcommand\\at[1]{\\left. #1 \\right\\lvert}\n\n\\newcommand\\elmnt[3]{\\phantom{}_{#1}^{#2}\\text{#3}}\n\n\\newcommand\\AA{\\mathring{A}}"},"Live-Map":{"slug":"Live-Map","filePath":"Live Map.md","title":"Live Map","links":[],"tags":[],"content":""},"Modded/Installing-the-Modpack":{"slug":"Modded/Installing-the-Modpack","filePath":"Modded/Installing the Modpack.md","title":"Installing the Modpack","links":[],"tags":[],"content":"This page will walk you through how to install and setup Prism Launcher for use with the modpack. This is the recommended way to install mods, and helps quickly switch between various installations without needing to edit your .minecraft directory. We will not be providing any help in this wiki towards other installation methods, but you may use other methods if you choose.\n\n\n                  \n                  Warning\n                  \n                \n\nThe Survival world is currently NOT modded. This page is to be updated and used next time we play modded. The current Survival world is Vanilla minecraft!\n\n\n\nStep 1 - Installing Java 17\nIf you have played with mods in 1.18 or above you can skip this step.\nInstall Java 17 from here, making sure you select the “JDK 17” tab www.oracle.com/uk/java/technologies/downloads/#jdk19-windows​\nScroll down and select the appropriate installer. Make sure you have selected JDK 17 and download any option that says “installer”\n\nStep 2 - Installing Prism Launcher\nDownload the Prism Launcher Installer from this page​\n.exe Installation\nSimply run the installer, making sure you select “launch Prism Launcher” at the end, then follow the instructions, ensuring you select Java 17 when Prism Launcher asks.\n.zip Installation\nExtract the .zip into a folder you will remember, preferably a Games folder if you have one\nOpen the extracted folder and run prismlauncher.exe and follow the instructions, ensuring you select Java 17 when Prism Launcher asks.\nYou may want to create a shortcut for this so it is easier to access. Simple right click on prismlauncher.exe and create a shortcut, you can then move this shortcut wherever you like.\nAfter installing the Prism Launcher you should get something that looks like this:\n\n\nStep 3 - Logging Into your Minecraft Account\nIn the top right of the launcher, there will be a greyed out “Accounts” button. Clicking this button will open a dropdown menu, in this menu select “Manage Accounts”\n \nOnce in this menu, select “Add Microsoft” in the top right. This will open a microsoft login page, and may autofill the code it is requesting. If not, go back to Prism Launcher and copy the code from the pop up. You will then be prompted to login to your microsoft account as normal.\nYour Prism Launcher should now look like this:\n\nYou should now close this accounts menu pop up.\n\nStep 4 - Creating an Instance\nCreating an instance for the modpack is quite simple, just press the “Add Instance” button in the top left, this will open a popup menu as follows.\n \nKeep this popup open, but you can safely ignore everything right now.\nPrism Launcher has a neat feature that means when you install a modpack, it will auto setup all your installation settings for you, so you don’t need to worry about selecting the correct game version or fabric version!\nThere are two methods you can use to install the modpack.\nMethod 1 - Curseforge Integration\nClicking on the curseforge button in the popup will open a menu as follows:\nSimply search for “Create Astral” and scroll until you find it. Once you locate it, click on it and ensure the version selected in the bottom right is “v2.1.4c”, if so, hit the “ok” button and the modpack will begin installing!\n \nAnd now wait for you pack to finish installing! If it is interrupted by another popup, see “Blocked Mods Found” before continuing.\nMethod 2 - Manual Installation from Curseforge\nAlternatively, you can install the modpack from the .zip file downloaded from the curseforge page itself. Ensure the version you are downloading is “v2.1.4c”.\nNow you have the .zip downloaded, head back to prism launcher and select “Import”, then hit “Browse” and locate the .zip and select the .zip you just downloaded. Now hit “OK” and the pack will begin installing!\n\nAnd now wait for you pack to finish installing! If it is interrupted by another popup, see “Blocked Mods Found” before continuing.\n”Blocked Mods Found”\nDuring the installation you may receive a message titled “Blocked mods found” with a scroll box with a bunch of links with hashes and crosses below them. Don’t worry! This just means the mod developer has blocked third party installers for their mod.\n\nSimply scroll down this list and click on every link, the crosses will begin turning into check marks. Once all the crosses are check marks, A little “All mods found” message will appear in the bottom left. Now, hit ok and the modpack will continue installing.\n\nStep 5 - Tweaking Installation Settings\nNow we have our installation set up, you might want to tweak some settings such as RAM allocation. To do this, click on the installation and select “Edit” on the right. This will open a popup, in this popup head to “Settings”\n \nOnce in settings, select the “Memory” check box and increase the “Maximum” value to the amount of RAM you want to allocate. You will need a minimum of 4gb.\nThis is also the menu where you can edit many other things to your liking such as game window size on launch. But this is not necessary.\n\nStep 6 - Launch the Game\nAnd you’re done! You can now launch the game!\nSimply select the modpack and hit launch. It may take a while to load depending on your hardware. On my laptop it took 70 seconds for the game window to appear, and then a further 90 seconds for the main menu to load, so just be patient.\n\nOnce you are in the main menu, don’t forget to complete this checklist:\n\n Video Settings - Make sure your graphic settings are set to what your PC can handle\n Audio Settings - Make sure you change the values to your liking\n Key Binds - The key binds will be at their defaults, so make sure to change them to your liking\n FOV Slider\n Language\n Resource Packs - while we don’t recommend installing any yourself, this modpack comes with some such as legacy create copper\n Shaders - again, we do not recommend installing any yourself, but this modpack comes with three shader packs pre-installed.\n"},"Server-Side-Changes":{"slug":"Server-Side-Changes","filePath":"Server Side Changes.md","title":"Server Side Changes","links":[],"tags":[],"content":"To help with performance, or to add quality of life features, we’ve made a couple of tweaks:\n\ne\ne\ne\n"},"index":{"slug":"index","filePath":"index.md","title":"Home","links":[],"tags":["hidden"],"content":"Welcome!\n\nWelcome to the IMMC: Survival wiki! Here you’ll find everything you need to know about the server’s features and/or mod list!\nWe are currently on Vanilla 1.21.10!"}}